{
    "description": "",
    "name": "ASD Blueprint - Macros for Trusted",
    "platforms": "windows10",
    "settingCount": 55,
    "technologies": "mdm",
    "templateReference": {
        "templateFamily": "none",
        "templateId": ""
    },
    "settings": [
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_admx_mmc_mmc_restrict_to_permitted_snapins_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_admx_mmc_mmc_restrict_to_permitted_snapins",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "0"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "1"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "2"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter~l_trustedlocations_l_disabletrustedloc_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter~l_trustedlocations_l_disabletrustedloc",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "3"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_turnofftrusteddocuments_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_turnofftrusteddocuments",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "4"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "5"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_vbawarningspolicy_l_empty_3",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_vbawarningspolicy_l_empty",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_vbawarningspolicy_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_vbawarningspolicy",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "6"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "simpleSettingCollectionValue": [
                                {
                                    "value": "19092",
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                                }
                            ],
                            "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems85_l_enteracommandbaridtodisable",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems85_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems85",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "7"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "simpleSettingCollectionValue": [
                                {
                                    "value": "19092",
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                                }
                            ],
                            "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems165_l_enteracommandbaridtodisable",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems165_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems165",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "8"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security_l_determinewhethertoforceencryptedexcel_l_determinewhethertoforceencryptedexceldropid_0",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security_l_determinewhethertoforceencryptedexcel_l_determinewhethertoforceencryptedexceldropid",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security_l_determinewhethertoforceencryptedexcel_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security_l_determinewhethertoforceencryptedexcel",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "9"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "10"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_trustaccesstovisualbasicproject_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_trustaccesstovisualbasicproject",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "11"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "12"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter~l_trustedlocations_l_disabletrustedloc_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter~l_trustedlocations_l_disabletrustedloc",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "13"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_turnofftrusteddocuments_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_turnofftrusteddocuments",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "14"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "15"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty4_3",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty4",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_vbawarningspolicy_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_vbawarningspolicy",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "16"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_automationsecurity_l_settheautomationsecuritylevel_2",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_automationsecurity_l_settheautomationsecuritylevel",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_automationsecurity_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_automationsecurity",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "17"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_disablealltrustbarnotificationsfor_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_disablealltrustbarnotificationsfor",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "18"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_disablevbaforofficeapplications319_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_disablevbaforofficeapplications319",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "19"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_l_macroruntimescanscopeenum_2",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_l_macroruntimescanscopeenum",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "20"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241_l_allowmixofpolicyanduserlocations_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings~l_trustcenter241_l_allowmixofpolicyanduserlocations",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "21"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "simpleSettingCollectionValue": [
                                {
                                    "value": "19092",
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                                }
                            ],
                            "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems157_l_enteracommandbaridtodisable",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems157_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems157",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "22"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_determinewhethertoforceencryptedppt_l_determinewhethertoforceencryptedpptdropid_0",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_determinewhethertoforceencryptedppt_l_determinewhethertoforceencryptedpptdropid",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_determinewhethertoforceencryptedppt_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security_l_determinewhethertoforceencryptedppt",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "23"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "24"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_trustaccesstovisualbasicproject_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_trustaccesstovisualbasicproject",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "25"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "26"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_trustedlocations_l_disabletrustedloc_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter~l_trustedlocations_l_disabletrustedloc",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "27"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_turnofftrusteddocuments_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_turnofftrusteddocuments",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "28"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "29"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty3_3",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty3",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_vbawarningspolicy_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_vbawarningspolicy",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "30"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_allowtrustedlocationsonthenetwork_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_allowtrustedlocationsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "31"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_disabletrustedloc_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_disabletrustedloc",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "32"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty_3",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_vbawarningspolicy_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_proj16v2~policy~l_proj~l_projectoptions~l_security~l_trustcenter_l_vbawarningspolicy",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "33"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "simpleSettingCollectionValue": [
                                {
                                    "value": "19092",
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                                }
                            ],
                            "settingDefinitionId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems2_l_enteracommandbaridtodisable",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems2_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems2",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "34"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_security_l_publisherautomationsecuritylevel_l_empty_2",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_security_l_publisherautomationsecuritylevel_l_empty",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_security_l_publisherautomationsecuritylevel_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_security_l_publisherautomationsecuritylevel",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "35"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_security~l_trustcenter_l_vbawarningspolicy_l_empty0_3",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_security~l_trustcenter_l_vbawarningspolicy_l_empty0",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_security~l_trustcenter_l_vbawarningspolicy_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_pub16v2~policy~l_microsoftofficepublisher~l_security~l_trustcenter_l_vbawarningspolicy",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "36"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "simpleSettingCollectionValue": [
                                {
                                    "value": "19092",
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                                }
                            ],
                            "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems1_l_enteracommandbaridtodisable",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems1_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems1",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "37"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_macrosecurity_l_enablemicrosoftvisualbasicforapplicationsproject_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_macrosecurity_l_enablemicrosoftvisualbasicforapplicationsproject",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "38"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_macrosecurity_l_loadmicrosoftvisualbasicforapplicationsprojectsf_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_macrosecurity_l_loadmicrosoftvisualbasicforapplicationsprojectsf",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "39"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_allowtrustedlocationsonthenetwork_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_allowtrustedlocationsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "40"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "41"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_disabletrustedloc_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_disabletrustedloc",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "42"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_turnofftrusteddocuments_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_turnofftrusteddocuments",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "43"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "44"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty_3",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_vbawarningspolicy_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_vbawarningspolicy",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "45"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "simpleSettingCollectionValue": [
                                {
                                    "value": "19092",
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                                }
                            ],
                            "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems174_l_enteracommandbaridtodisable",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems174_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_disableitemsinuserinterface~l_custom_l_disablecommandbarbuttonsandmenuitems174",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "46"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "47"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_determinewhethertoforceencryptedword_l_determinewhethertoforceencryptedworddropid_0",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_determinewhethertoforceencryptedword_l_determinewhethertoforceencryptedworddropid",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_determinewhethertoforceencryptedword_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_determinewhethertoforceencryptedword",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "48"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_trustaccesstovisualbasicproject_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_trustaccesstovisualbasicproject",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "49"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter~l_trustedlocations_l_allowtrustedlocationsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "50"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter~l_trustedlocations_l_disabletrustedloc_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter~l_trustedlocations_l_disabletrustedloc",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "51"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_turnofftrusteddocuments_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_turnofftrusteddocuments",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "52"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_turnofftrusteddocumentsonthenetwork",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "53"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty19_3",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_vbawarningspolicy_l_empty19",
                            "auditRuleInformation": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_vbawarningspolicy_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_vbawarningspolicy",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "54"
        }
    ]
}