{
    "description": "Collection of Auditing settings from the settings catalogue required for Essential Eight Maturity. ",
    "name": "ASD-004 Windows Hardening - Defender",
    "platforms": "windows10",
    "settingCount": 4,
    "technologies": "mdm",
    "templateReference": {
        "templateFamily": "none",
        "templateId": ""
    },
    "settings": [
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_2",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudblocklevel",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "0"
        },
        {
            "settingInstance": {
                "simpleSettingValue": {
                    "value": 50,
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudextendedtimeout",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
            },
            "id": "1"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "2"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_submitsamplesconsent",
                "auditRuleInformation": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "3"
        }
    ]
}